In [1]:
import pandas as pd

In [2]:
import numpy as np

conos = pd.DataFrame({
    'Sabor': np.array(['mora', 'vainilla','chocolate', 'mora', 'chocolate']),
    'Precio': np.array([3500, 4700, 6500, 5200, 5700 ])
})

In [9]:
conos['Precio']

0    3500
1    4700
2    6500
3    5200
4    5700
Name: Precio, dtype: int64

In [10]:
conos[['Sabor', 'Precio']]

       Sabor  Precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [15]:
conos[: :-1]

       Sabor  Precio
4  chocolate    5700
3       mora    5200
2  chocolate    6500
1   vainilla    4700
0       mora    3500

In [18]:
conos[1:3]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500

In [20]:
conos.sort_values(by='Sabor', ascending=False)

       Sabor  Precio
1   vainilla    4700
0       mora    3500
3       mora    5200
2  chocolate    6500
4  chocolate    5700

In [21]:
conos.head(2)

      Sabor  Precio
0      mora    3500
1  vainilla    4700

In [22]:
conos.tail(1)

       Sabor  Precio
4  chocolate    5700

In [26]:
conos.sample(1)

  Sabor  Precio
3  mora    5200

In [27]:
conos.describe()

            Precio
count     5.000000
mean   5120.000000
std    1123.387734
min    3500.000000
25%    4700.000000
50%    5200.000000
75%    5700.000000
max    6500.000000

In [28]:
conos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sabor   5 non-null      object
 1   Precio  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [30]:
conos.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
conos.iloc[2]

Sabor     chocolate
Precio         6500
Name: 2, dtype: object

In [32]:
conos[1:]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [33]:
conos.iloc[1:]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [35]:
conos[2:5]

       Sabor  Precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [45]:
conos.iloc[[1,4]]

       Sabor  Precio
1   vainilla    4700
4  chocolate    5700

In [44]:
conos.iloc[2,1]

np.int64(6500)

In [48]:
conos['Precio'][2]

np.int64(6500)

In [49]:
conos_i = conos.set_index('Sabor', inplace=False)
conos_i

           Precio
Sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700

In [51]:
conos_i['Precio']

Sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700
Name: Precio, dtype: int64

In [53]:
conos_i.index

Index(['mora', 'vainilla', 'chocolate', 'mora', 'chocolate'], dtype='object', name='Sabor')

In [62]:
conos_i['Precio']['chocolate']

Sabor
chocolate    6500
chocolate    5700
Name: Precio, dtype: int64

In [64]:
conos_i.loc['vainilla', 'Precio']

np.int64(4700)

## Seleccion por condicion logica

In [69]:
#Mascara
conos['Precio']> 5000

0    False
1    False
2     True
3     True
4     True
Name: Precio, dtype: bool

In [70]:
conos[conos['Precio']> 5000]

       Sabor  Precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [75]:
conos[conos['Precio']<5000 ]

      Sabor  Precio
0      mora    3500
1  vainilla    4700

In [80]:
conos_i.loc['chocolate']

           Precio
Sabor
chocolate    6500
chocolate    5700

## Merge

In [4]:
valoracion = pd.DataFrame({
    'Tipo' : np.array(['mora','chocolate', 'vainilla']),
    'Calificacion' : np.array([2.5, 3.5, 4])
})
valoracion

        Tipo  Calificacion
0       mora           2.5
1  chocolate           3.5
2   vainilla           4.0